In [143]:
import warnings
warnings.filterwarnings("ignore")

In [144]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [145]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [146]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [147]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [148]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [149]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [150]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [151]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [152]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [153]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [154]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [155]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [156]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [157]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [158]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

### Create a report

In [159]:
users['reg_month'] = users['reg_date'].values.astype('datetime64[M]')
#create a reg_month column

In [160]:
min_month = users['reg_date'].values.astype('datetime64[M]').min()
#minimum month

In [161]:
max_month = users['reg_date'].values.astype('datetime64[M]').max()
#maximum month

In [162]:
(min_month, max_month)
#range of minimum and maximum

(numpy.datetime64('2018-01'), numpy.datetime64('2018-12'))

In [163]:
months = pd.DataFrame(pd.date_range(min_month, max_month, freq='MS'))
#create a dataframe of the months

In [164]:
months

            0
0  2018-01-01
1  2018-02-01
2  2018-03-01
3  2018-04-01
4  2018-05-01
5  2018-06-01
6  2018-07-01
7  2018-08-01
8  2018-09-01
9  2018-10-01
10 2018-11-01
11 2018-12-01

In [165]:
months.columns = ['month'] #rename the month column

In [166]:
len(users)*len(months) #check length of merging each user with each month

6000

In [167]:
users['key'] = 1
months['key'] = 1
#create a uniform key to merge the 2df on

In [168]:
report = months.merge(users, on='key')
#the merge

In [169]:
report.head()

,month,key,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month
0,2018-01-01,1,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN,2018-12-01
1,2018-01-01,1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN,2018-08-01
2,2018-01-01,1,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN,2018-10-01
3,2018-01-01,1,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN,2018-01-01
4,2018-01-01,1,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN,2018-05-01

In [170]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   month       6000 non-null   datetime64[ns]
 1   key         6000 non-null   int64
 2   user_id     6000 non-null   int64
 3   first_name  6000 non-null   object
 4   last_name   6000 non-null   object
 5   age         6000 non-null   int64
 6   city        6000 non-null   object
 7   reg_date    6000 non-null   object
 8   plan        6000 non-null   object
 9   churn_date  408 non-null    object
 10  reg_month   6000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(6)
memory usage: 562.5+ KB

In [171]:
len(report[report['month']>=report['reg_month']]) #some users came after the minimal date

3355

In [172]:
report = report[report['month']>=report['reg_month']] # select month for user after registration

In [173]:
report = report[['month', 'key', 'user_id', 'city', 'plan', 'reg_month']] #select only wanted columns

In [174]:
#specific user
report[report['user_id'] == 1000]

,month,key,user_id,city,plan,reg_month
5500,2018-12-01,1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-12-01

In [175]:
report[report['user_id'] == 1003]

          month  key  user_id           city  plan  reg_month
3    2018-01-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
503  2018-02-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1003 2018-03-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1503 2018-04-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2003 2018-05-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2503 2018-06-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3003 2018-07-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3503 2018-08-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4003 2018-09-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4503 2018-10-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5003 2018-11-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5503 2018-12-01    1     1003  Tulsa, OK MSA  surf 2018-01-01

### Calls

In [176]:
data = users[['user_id', 'city', 'plan']]
#take specific columns from users

In [177]:
data_calls = data.merge(calls, how='outer', on='user_id')
#merge on data with calls by the outer

In [178]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [179]:
data_calls.head()

,user_id,city,plan,id,call_date,duration
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_93,2018-12-27,8.52
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_145,2018-12-27,13.66
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_247,2018-12-27,14.48
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_309,2018-12-28,5.76
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_380,2018-12-30,4.22

In [180]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')

In [181]:
data_calls['month'] = data_calls['call_date'].values.astype('datetime64[M]')
#create a month column of datetime

In [182]:
calls_month = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
#create a groupby which has the sum of call duration for each user in each month

In [183]:
calls_month.sample(10)

     user_id      month duration
                             sum
651     1141 2018-10-01  1010.26
690     1149 2018-11-01   567.86
1041    1224 2018-08-01   279.22
2220    1492 2018-11-01   395.18
1035    1223 2018-08-01   703.56
1983    1434 2018-08-01   344.68
1632    1359 2018-11-01   369.16
1366    1301 2018-12-01   895.28
1019    1220 2018-06-01   453.18
1573    1347 2018-10-01   396.98

In [184]:
calls_month.columns = ['user_id', 'month', 'total_duration'] # maybe round up the duration at this point

In [185]:
#round up the minutes to the nearest whole number
calls_month['total_duration'] = calls_month['total_duration'].round(0)

In [186]:
user_plan = users[['user_id', 'plan']]
#select each user and there plan to be the dictionary values for merging

In [187]:
user_plan[user_plan['user_id'] == 1233] #testing

     user_id  plan
233     1233  surf

In [188]:
calls_month = calls_month.merge(user_plan, on='user_id', how='left')
#merge to find each users plan, in each month.

In [189]:
plans
#look at plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [190]:
call_plan = plans[['plan_name', 'minutes_included']]
#a df for minutes included in each plan

In [191]:
call_plan.columns = ['plan', 'plan_minutes']
#change the column names

In [192]:
call_plan
#check

       plan  plan_minutes
0      surf           500
1  ultimate          3000

In [193]:
calls_month = calls_month.merge(call_plan, on='plan', how='left')
#merge each user with their minutes included for their plan, in each month

In [194]:
calls_month['extra_mins'] = calls_month['total_duration'] - calls_month['plan_minutes']
#calculate the extra minutes used every month according tomplan package

In [195]:
#calls_month['extra_mins'] = calls_month['extra_mins'].round(0) #round up the minutes

In [196]:
#change mins to integer
#calls_month['extra_mins'] = calls_month['extra_mins'].astype(np.int64)

In [197]:
#a function to change the -ve values to zero
def count_calc(extra):
    if extra < 0:
        return 0
    if extra == 0:
        return 0
    if extra > 0:
        return extra

In [198]:
calls_month['extra_duration'] = calls_month['extra_mins'].apply(count_calc)
#apply the function to the column

In [199]:
extraminute_plan = plans[['plan_name', 'usd_per_minute']]
# a df to use as key for extra mins in each plan

In [200]:
extraminute_plan.columns = ['plan', 'usd_per_minute']
#change the columns

In [201]:
calls_month = calls_month.merge(extraminute_plan, on='plan', how='left')
#merge each extra minute cost to the calls

In [202]:
calls_month['call_cost'] = calls_month['extra_duration'] * calls_month['usd_per_minute']
#create a cost column of extra mintes used

In [203]:
calls_month = calls_month[['user_id', 'month', 'call_cost']]
#select required columns

In [204]:
report = report.merge(calls_month, on=['user_id', 'month'], how='left')
#merge with the report

In [205]:
report.shape

(3355, 7)

In [206]:
calls_month.shape

(2258, 3)

In [207]:
report.head()
#NaN are for users who did not make calls that month
#0.0 are for users who had no extra cost

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

### Messages

In [208]:
data.head()

   user_id                                   city      plan
0     1000  Atlanta-Sandy Springs-Roswell, GA MSA  ultimate
1     1001        Seattle-Tacoma-Bellevue, WA MSA      surf
2     1002   Las Vegas-Henderson-Paradise, NV MSA      surf
3     1003                          Tulsa, OK MSA      surf
4     1004        Seattle-Tacoma-Bellevue, WA MSA      surf

In [209]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [210]:
data_messages = data.merge(messages, on='user_id', how='right')

In [211]:
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')

In [212]:
data_messages['id'].duplicated().sum()
#all messages are unique, so they each get a count of 1.

0

In [213]:
data_messages['msg_count'] = 1

In [214]:
data_messages.head()

,user_id,city,plan,id,message_date,msg_count
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27,1
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31,1
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31,1
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27,1
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26,1

In [215]:
data_messages['month'] = data_messages['message_date'].values.astype('datetime64[M]')

In [216]:
msg_month = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()

In [217]:
msg_month.sample(10)

     user_id      month msg_count
                              sum
642     1174 2018-07-01        75
690     1187 2018-09-01        14
1069    1281 2018-12-01        38
1629    1445 2018-06-01        11
1571    1430 2018-12-01        32
663     1179 2018-11-01        12
1216    1329 2018-11-01        89
1530    1412 2018-12-01        59
683     1184 2018-12-01        37
648     1175 2018-10-01        31

In [218]:
msg_month.columns = ['user_id', 'month', 'total_msg']

In [219]:
msg_month = msg_month.merge(user_plan, on='user_id', how='left')

In [220]:
msg_plan = plans[['plan_name', 'messages_included']]
msg_plan.columns = ['plan', 'plan_messages']

In [221]:
msg_plan

       plan  plan_messages
0      surf             50
1  ultimate           1000

In [222]:
msg_month = msg_month.merge(msg_plan, on='plan', how='left')

In [223]:
msg_month['xtra_msg'] = msg_month['total_msg'] - msg_month['plan_messages']

In [224]:
msg_month['xtra_txt'] = msg_month['xtra_msg'].apply(count_calc)

In [225]:
extramsg_plan = plans[['plan_name', 'usd_per_message']]

In [226]:
extramsg_plan.columns = ['plan', 'usd_per_message']

In [227]:
msg_month = msg_month.merge(extramsg_plan, on='plan', how='left')

In [228]:
msg_month['msg_cost'] = msg_month['xtra_txt'] * msg_month['usd_per_message']

In [229]:
msg_month = msg_month[['user_id', 'month', 'msg_cost']]

In [230]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

In [231]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(2)
memory usage: 209.7+ KB

In [232]:
report = report.merge(msg_month, on=['user_id', 'month'], how='left')

In [233]:
report.shape[0]

3355

### Internet

In [234]:
#convert to GB

In [235]:
data_internet = data.merge(internet, how='right', on='user_id')

In [236]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104825 entries, 0 to 104824
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104825 non-null  int64
 1   city          104825 non-null  object
 2   plan          104825 non-null  object
 3   id            104825 non-null  object
 4   session_date  104825 non-null  object
 5   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [237]:
data_internet['session_date'] = pd.to_datetime(data_internet['session_date'], format='%Y-%m-%d')

In [238]:
data_internet['id'].duplicated().sum()

0

In [239]:
data_internet.head()

,user_id,city,plan,id,session_date,mb_used
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_13,2018-12-29,89.86
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_204,2018-12-31,0.00
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_379,2018-12-28,660.40
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_413,2018-12-26,270.99
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_442,2018-12-27,880.22

In [240]:
data_internet['month'] = data_internet['session_date'].values.astype('datetime64[M]')

In [241]:
mb_month = data_internet.groupby(['user_id', 'month'])[['mb_used']].agg(['sum']).reset_index()
mb_month.columns = ['user_id', 'month', 'total_mb']

In [242]:
mb_month.head()

   user_id      month  total_mb
0     1000 2018-12-01   1901.47
1     1001 2018-08-01   6919.15
2     1001 2018-09-01  13314.82
3     1001 2018-10-01  22330.49
4     1001 2018-11-01  18504.30

In [243]:
mb_month = mb_month.merge(user_plan, on='user_id', how='left')

In [244]:
mb_plan = plans[['plan_name', 'mb_per_month_included']]
mb_plan.columns = ['plan', 'plan_mb']

In [245]:
mb_month = mb_month.merge(mb_plan, on='plan', how='left')

In [246]:
mb_month['extra_mb'] = mb_month['total_mb'] - mb_month['plan_mb']

In [247]:
mb_month['extra_mb'] = mb_month['extra_mb'].apply(count_calc)

In [248]:
def mb_gb_converter(mb):
    if mb == 0:
        return 0
    if mb > 0:
        return mb/1024

In [249]:
mb_month['extra_gb'] = mb_month['extra_mb'].apply(mb_gb_converter)

In [250]:
#write a function the checks decimal place values and performs an action

In [251]:
mb_month['extra_gb'] = mb_month['extra_gb'].round(0)

In [252]:
x = np.round([0.28, 0.50, 0.64, 0.09, 4.59, 3.28], decimals=0)

In [253]:
x

array([0., 0., 1., 0., 5., 3.])

In [254]:
extramb_plan = plans[['plan_name', 'usd_per_gb']]
extramb_plan.columns = ['plan', 'usd_per_gb']

In [255]:
mb_month = mb_month.merge(extramb_plan, on='plan', how='left')

In [256]:
mb_month['gb_cost'] = mb_month['extra_gb'] * mb_month['usd_per_gb']

In [257]:
mb_month = mb_month[['user_id', 'month', 'gb_cost']]

In [258]:
report = report.merge(mb_month, on=['user_id', 'month'], how='left')

In [267]:
report.sample(20)

,month,key,user_id,city,plan,reg_month,call_cost,msg_cost,gb_cost,total_cost,monthly_pay,profit
2028,2018-10-01,1,1075,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-08-01,0.00,0.93,0.0,0.93,20,20.93
526,2018-05-01,1,1182,"Charlotte-Concord-Gastonia, NC-SC MSA",surf,2018-05-01,0.00,0.00,0.0,0.00,20,20.00
790,2018-06-01,1,1245,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-06-01,0.00,0.00,0.0,0.00,20,20.00
3128,2018-12-01,1,1273,"Baton Rouge, LA MSA",ultimate,2018-10-01,0.00,0.00,0.0,0.00,70,70.00
2546,2018-11-01,1,1170,"Pittsburgh, PA MSA",surf,2018-09-01,5.07,0.00,130.0,135.07,20,155.07
1147,2018-07-01,1,1361,"Birmingham-Hoover, AL MSA",surf,2018-04-01,0.00,0.00,0.0,0.00,20,20.00
572,2018-05-01,1,1299,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-01-01,0.00,0.00,30.0,30.00,20,50.00
775,2018-06-01,1,1224,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-06-01,0.00,0.00,0.0,0.00,70,70.00
529,2018-05-01,1,1187,"Austin-Round Rock-Georgetown, TX MSA",surf,2018-02-01,2.73,0.00,60.0,62.73,20,82.73
2378,2018-10-01,1,1483,"Chicago-Naperville-Elgin, IL-IN-WI MSA",surf,2018-04-01,0.00,0.00,0.0,0.00,20,20.00
180,2018-03-01,1,1155,"Miami-Fort Lauderdale-West Palm Beach, FL MSA",ultimate,2018-02-01,0.00,0.00,0.0,0.00,70,70.00
1453,2018-08-01,1,1315,"Raleigh-Cary, NC MSA",surf,2018-04-01,0.00,0.00,0.0,0.00,20,20.00
1823,2018-09-01,1,1315,"Raleigh-Cary, NC MSA",surf,2018-04-01,0.00,0.00,0.0,0.00,20,20.00
1964,2018-09-01,1,1496,"New Orleans-Metairie, LA MSA",surf,2018-02-01,0.00,0.00,10.0,10.00,20,30.00
2623,2018-11-01,1,1252,"Detroit-Warren-Dearborn, MI MSA",surf,2018-06-01,0.00,0.00,0.0,0.00,20,20.00
2513,2018-11-01,1,1134,"Chicago-Naperville-Elgin, IL-IN-WI MSA",surf,2018-09-01,0.00,0.00,80.0,80.00,20,100.00
540,2018-05-01,1,1220,"Cincinnati, OH-KY-IN MSA",surf,2018-04-01,4.65,0.00,30.0,34.65,20,54.65
2321,2018-10-01,1,1416,"Minneapolis-St. Paul-Bloomington, MN-WI MSA",surf,2018-10-01,0.00,0.00,10.0,10.00,20,30.00
3054,2018-12-01,1,1199,"San Antonio-New Braunfels, TX MSA",ultimate,2018-08-01,0.00,0.00,0.0,0.00,70,70.00
380,2018-04-01,1,1312,"Fresno, CA MSA",surf,2018-01-01,0.00,0.00,130.0,130.00,20,150.00

### Profit

In [260]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
 7   msg_cost   1806 non-null   float64
 8   gb_cost    2277 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(2)
memory usage: 262.1+ KB

In [261]:
#fill in NaN values with 0
report.fillna(value=0, inplace=True)

In [262]:
report['total_cost'] = report['call_cost'] + report['msg_cost'] + report['gb_cost']

In [263]:
plan_charge = plans[['plan_name', 'usd_monthly_pay']]

In [264]:
plan_charge.columns = ['plan', 'monthly_pay']

In [265]:
report = report.merge(plan_charge, on='plan', how='left')

In [266]:
report['profit'] = report['total_cost'] + report['monthly_pay']